In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
ser1 = Series(np.arange(3), index = ['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int32

In [7]:
ser2 = Series([3,4,5,6], index = ['a','b','c','d'])
ser2

a    3
b    4
c    5
d    6
dtype: int64

In [9]:
ser1 + ser2 # here the index names need to be same in both series else will give NaN

a    3.0
b    5.0
c    7.0
d    NaN
dtype: float64

In [11]:
df = DataFrame(np.arange(4).reshape(2,2), index = ['ny','ca'], columns = list('AB'))
df

    A  B
ny  0  1
ca  2  3

In [12]:
df2 = DataFrame(np.arange(9).reshape(3,3), index = ['ny','ca','nc'], columns = list('ADC'))
df2

    A  D  C
ny  0  1  2
ca  3  4  5
nc  6  7  8

In [13]:
df +df2 # only actual values with rows and columns matching will add up

      A   B   C   D
ca  5.0 NaN NaN NaN
nc  NaN NaN NaN NaN
ny  0.0 NaN NaN NaN

In [16]:
df.add(df2, fill_value = 0) # by this way you dnt lose orignal values

      A    B    C    D
ca  5.0  3.0  5.0  4.0
nc  6.0  NaN  8.0  7.0
ny  0.0  1.0  2.0  1.0

In [17]:
ser3 = df2.iloc[0]
ser3

A    0
D    1
C    2
Name: ny, dtype: int32

In [18]:
df2 - ser3 # subtract ser3 ie [0,1,2] from each row

    A  D  C
ny  0  0  0
ca  3  3  3
nc  6  6  6

In [19]:
#sorting and ranking
ser3

A    0
D    1
C    2
Name: ny, dtype: int32

In [22]:
ser3.sort_values() # or by sort_index

A    0
D    1
C    2
Name: ny, dtype: int32

In [23]:
from numpy.random import randn
ser4 = Series(randn(10))
ser4

0   -1.736012
1    1.046781
2    0.209783
3   -0.742569
4    1.063409
5   -0.602499
6    0.523136
7   -1.898409
8   -1.062696
9    1.520218
dtype: float64

In [25]:
ser4.sort_values()

7   -1.898409
0   -1.736012
8   -1.062696
3   -0.742569
5   -0.602499
2    0.209783
6    0.523136
1    1.046781
4    1.063409
9    1.520218
dtype: float64

In [26]:
ser4.rank() #maintains the index in order and gives rank of values to give order

0     2.0
1     8.0
2     6.0
3     4.0
4     9.0
5     5.0
6     7.0
7     1.0
8     3.0
9    10.0
dtype: float64